app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "voiture"], ["url", "v"], ["created_at", "2017-12-18 17:12:58.387175"], ["updated_at", "2017-12-18 17:12:58.387175"], ["user_id", 1]]
---
  def create
  #  @link = Link.new(link_params)

      @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save